<template>
  <q-dialog :model-value="checkToggle" @hide="emit('close_policy',false)" persistent>
    <q-card style="min-width:80%">
      <q-card-section>
        <div class="text-h2 policy-title">Политика конфиденциальности</div>
      </q-card-section>
      <q-separator/>
      <q-card-section class="scroll text_pol">
        <p>Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между (далее Современные
          технологии в метрологии или Администрация) с одной стороны и пользователем сайта с другой.<br/>
          Сайт Современные технологии в метрологии не является средством массовой информации.<br/>
          <br/>
          Используя сайт, Вы соглашаетесь с условиями данного соглашения.<br/>
          <b>Если Вы не согласны с условиями данного соглашения, не используйте сайт Современные технологии в
            метрологии!</b><br/>
        </p>
        <h3>ПРЕДМЕТ СОГЛАШЕНИЯ</h3>
        <p><b>Администрация предоставляет пользователю право на размещение на сайте следующей информации:</b><br/>
          - Текстовой информации<br/>
          &nbsp;</p>
        <h3>ПРАВА И ОБЯЗАННОСТИ СТОРОН</h3>
        <p><b>Пользователь имеет право:</b><br/>
          - осуществлять поиск информации на сайте<br/>
          - получать информацию на сайте<br/>
          - копировать информацию на другие сайты с указанием источника<br/>
          - копировать информацию на другие сайты с разрешения Администрации сайта<br/>
          - использовать информацию сайта в личных некоммерческих целях<br/>
          <br/>
          <b>Администрация имеет право:</b><br/>
          - по своему усмотрению и необходимости создавать, изменять, отменять правила<br/>
          - ограничивать доступ к любой информации на сайте<br/>
          - создавать, изменять, удалять информацию<br/>
          - удалять учетные записи<br/>
          - отказывать в регистрации без объяснения причин<br/>
          <br/>
          <b>Пользователь обязуется:</b><br/>
          - обеспечить достоверность предоставляемой информации<br/>
          - обеспечивать сохранность личных данных от доступа третьих лиц<br/>
          - не копировать информацию с других источников<br/>
          - при копировании информации с других источников, включать в её состав информацию об авторе<br/>
          - не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или
          религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная
          или административная ответственность<br/>
          - не нарушать работоспособность сайта<br/>
          - не совершать действия, направленные на введение других Пользователей в заблуждение<br/>
          - не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам<br/>
          - не регистрировать учетную запись от имени или вместо другого лица за исключением случаев, предусмотренных
          законодательством РФ<br/>
          - не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также
          иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ<br/>
          - не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и
          его Сервисами<br/>
          <br/>
          <b>Администрация обязуется:</b><br/>
          - поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от
          Администрации причинам.<br/>
          - осуществлять разностороннюю защиту учетной записи Пользователя<br/>
          - защищать информацию, распространение которой ограничено или запрещено законами путем вынесения
          предупреждения либо удалением учетной записи пользователя, нарушившего правила<br/>
          - предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в
          случаях, установленных законом<br/>
          &nbsp;</p>
        <h3>ОТВЕТСТВЕННОСТЬ СТОРОН</h3>
        <p>- пользователь лично несет полную ответственность за распространяемую им информацию<br/>
          - администрация не несет никакой ответственности за достоверность информации, скопированной из других
          источников<br/>
          - администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных
          услуг<br/>
          - администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами<br/>
          - в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и
          т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную
          работу информационного ресурса<br/>
          &nbsp;</p>
        <h3>УСЛОВИЯ ДЕЙСТВИЯ СОГЛАШЕНИЯ</h3>
        <p>Данное Соглашение вступает в силу при любом использовании данного сайта.<br/>
          Соглашение действует бессрочно.<br/>
          Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему
          усмотрению.<br/>
          Администрация не оповещает пользователей об изменении в Соглашении.</p>
      </q-card-section>
      <q-separator/>
      <q-card-actions align="right">
        <q-btn flat label="Принять" color="green" v-close-popup/>
      </q-card-actions>
    </q-card>
  </q-dialog>
</template>

<script setup>
const props = defineProps({
  checkToggle: {
    type: Boolean,
    required: true,
  }
})
const emit = defineEmits(['close_policy'])
</script>


<style scoped>

</style>
